Revit 2027 API
ExtendedPropertiesLink.Reload Method
 Reloads the linked extended properties with the latest information.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkLoadResult Reload()
Public Function Reload As LinkLoadResult
public:
LinkLoadResult^ Reload()
member Reload : unit -> LinkLoadResult
Return Value
LinkLoadResult
Exceptions
Exception | Condition
ArgumentException |  The server referenced by the stored ExternalResourceReference does not exist or does not implement IExternalResourceServer. -or- The stored ExternalResourceReference is not in a format that is supported by its server. -or- The stored ExternalResourceReference is not supported by the external server associated with this link.
InvalidOperationException |  This ExtendedPropertiesLink does not contain an external resource reference compatible with the ExternalResourceType. -or- The document does not support extended properties links.
ModificationForbiddenException |  The document containing this ExtendedPropertiesLink is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this ExtendedPropertiesLink is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document containing this ExtendedPropertiesLink has no open transaction.
See Also
Reference
ExtendedPropertiesLink Class
Autodesk.Revit.DB.ExternalData Namespace